backend/controllers/CashierController.php

SELECT * FROM "cashier"
SELECT * FROM "cashier_agreements" WHERE "id" = 683 ORDER BY "id" LIMIT 1
---
    public function actionIndex()
    {

        if(Yii::$app->request->get('table') == 'cashier') {

            $AllCashier = Cashier::find()->asArray()->all();

            $jsonCashierInfo = [];
            foreach ($AllCashier as $valueCashier) {
                $jsonValuesForCashier = new \stdClass();
                $jsonValuesForCashier->cashier_id = $valueCashier['id'];
                $jsonValuesForCashier->cashier_name = $valueCashier['name'];
                $jsonValuesForCashier->cashier_second_name = $valueCashier['second_name'];
                $jsonValuesForCashier->agreement_id = $valueCashier['agreement_id'];

                $AllCashierAgreements = CashierAgreements::find()->where(['=', 'id', $valueCashier['agreement_id']])->orderBy('id')->limit(1)->asArray()->all();